particle-iot/device-os/hal/src/rtl872x/i2c_hal.cpp
        for (uint32_t i = 0; i < quantity; i++) {
            if (!WAIT_TIMED(transConfig_.timeout_ms, I2C_CheckFlagState(i2cDev_, BIT_IC_STATUS_TFNF) == 0)) {
                reset();
                return SYSTEM_ERROR_I2C_FILL_DATA_TIMEOUT;
            }
            uint8_t data = 0xFF;
            if (txBuffer_.get(&data) != 1) {
                return SYSTEM_ERROR_NOT_ENOUGH_DATA;
            }
            if(i >= quantity - 1) {
                if (stop) {
                    // Generate stop signal
                    i2cDev_->IC_DATA_CMD = data | BIT_CTRL_IC_DATA_CMD_STOP;
                } else {
                    // Generate restart signal
                    i2cDev_->IC_DATA_CMD = data | BIT_CTRL_IC_DATA_CMD_RESTART;
                }
            } else {
                // The address will be sent before sending the first data byte
                i2cDev_->IC_DATA_CMD = data;
            }
            if (WAIT_TIMED_ROUTINE(transConfig_.timeout_ms, I2C_CheckFlagState(i2cDev_, BIT_IC_STATUS_TFE) == 0, checkAbrt) < 0) {
                reset();
                return SYSTEM_ERROR_I2C_TX_DATA_TIMEOUT;
            }
            if(checkAbrt()) {
                LOG(TRACE, "Abort: %08X", i2cDev_->IC_TX_ABRT_SOURCE);
                I2C_ClearAllINT(i2cDev_);
                return SYSTEM_ERROR_CANCELLED;
            }
        }
        return SYSTEM_ERROR_NONE;
    }

    void flush() {
        txBuffer_.reset();
        rxBuffer_.reset();
    }

    void setOnRequestedCallback(void (*function)(void)) {
        onRequested_ = function;
    }

    void setOnReceivedCallback(void (*function)(int)) {
        onReceived_ = function;
    }

    int lock() {
        if (mutex_ && !hal_interrupt_is_isr()) {
            return os_mutex_recursive_lock(mutex_);
        }
        return SYSTEM_ERROR_INVALID_STATE;
    }

    int unlock() {
        if (mutex_ && !hal_interrupt_is_isr()) {
            return os_mutex_recursive_unlock(mutex_);
        }
        return SYSTEM_ERROR_INVALID_STATE;
    }

    static I2cClass* getInstance(hal_i2c_interface_t i2c) {
        static I2cClass i2cs[] = {
            { I2C0_DEV, SDA, SCL }
        };
        CHECK_TRUE(i2c < sizeof(i2cs) / sizeof(i2cs[0]), nullptr);
        return &i2cs[i2c];
    }

private:
    I2cClass(I2C_TypeDef* i2cDev, hal_pin_t sda, hal_pin_t scl)
            : i2cDev_(i2cDev),
              sdaPin_(sda),
              sclPin_(scl),
              configured_(false),
              heapBuffer_(false),
              i2cInitStruct_(),
              onRequested_(nullptr),
              onReceived_(nullptr),
              mutex_(nullptr) {
    }
    ~I2cClass() = default;

    bool isConfigValid(const hal_i2c_config_t* config) {
        if ((config == nullptr) || (config->rx_buffer == nullptr || config->rx_buffer_size == 0 ||
                config->tx_buffer == nullptr || config->tx_buffer_size == 0)) {
            return false;
        }
        return true;
    }

    bool checkAbrt() {
        if(I2C_GetRawINT(i2cDev_) & BIT_IC_RAW_INTR_STAT_TX_ABRT) {
            return true;
        }
        return false;
    }

    void slaveReadRxFifo() {
        while (I2C_CheckFlagState(i2cDev_, (BIT_IC_STATUS_RFNE | BIT_IC_STATUS_RFF))) {
            rxBuffer_.put((uint8_t)I2C_ReceiveData(i2cDev_));
        }
        if (onReceived_ && rxBuffer_.data() > 0) {
            onReceived_(rxBuffer_.data());
        }
    }

    static void i2cSlaveIntHandler(void* context) {
        auto instance = (I2cClass*)context;
        uint32_t intStatus = I2C_GetINT(instance->i2cDev_);

        if (intStatus & BIT_IC_INTR_STAT_R_START_DET) {
            I2C_ClearINT(instance->i2cDev_, BIT_IC_INTR_STAT_R_START_DET);
            // Read RX FIFO in case of repeated write
            instance->slaveReadRxFifo();
            instance->rxBuffer_.reset();
            instance->txBuffer_.reset();
        }

        // Slave receiver
        if ((intStatus & BIT_IC_INTR_STAT_R_RX_FULL) || (intStatus & BIT_IC_INTR_STAT_R_RX_OVER)) {
            if (intStatus & BIT_IC_INTR_STAT_R_RX_OVER) {
                I2C_ClearINT(instance->i2cDev_, BIT_IC_INTR_STAT_R_RX_OVER);
            }
            instance->slaveReadRxFifo();
        }
        if (intStatus & BIT_IC_INTR_STAT_R_STOP_DET) {
            I2C_ClearINT(instance->i2cDev_, BIT_IC_INTR_STAT_R_STOP_DET);
            instance->slaveReadRxFifo();
        }

        // Slave transmitter
        if (intStatus & BIT_IC_INTR_STAT_R_RD_REQ) {
            I2C_ClearINT(instance->i2cDev_, BIT_IC_INTR_STAT_R_RD_REQ);
            if (instance->txBuffer_.data() <= 0) {
                if (instance->onRequested_) {
                    // User should fill the tx buffer in the callback
                    instance->onRequested_();
                }
            }
            uint8_t data = 0xFF;
            if (instance->txBuffer_.get(&data) == 1) {
                I2C_SlaveSend(instance->i2cDev_, data);
            } else {
                I2C_SlaveSend(instance->i2cDev_, 0xFF);
            }
        }
        if (intStatus & BIT_IC_INTR_STAT_R_RX_DONE) {
            I2C_ClearINT(instance->i2cDev_, BIT_IC_INTR_STAT_R_RX_DONE);
            instance->txBuffer_.reset();
        }
    }

    I2C_TypeDef* i2cDev_;
    hal_pin_t sdaPin_;
    hal_pin_t sclPin_;

    bool configured_;
    volatile hal_i2c_state_t state_;
    
    particle::services::RingBuffer<uint8_t> txBuffer_;
    particle::services::RingBuffer<uint8_t> rxBuffer_;
    bool heapBuffer_;

    I2C_InitTypeDef i2cInitStruct_;
    hal_i2c_transmission_config_t transConfig_;

    void (*onRequested_)(void);
    void (*onReceived_)(int);

    os_mutex_recursive_t mutex_;
};

class I2cLock {
public:
    I2cLock() = delete;

    I2cLock(I2cClass* i2c)
            : i2c_(i2c) {
        i2c_->lock();
    }

    ~I2cLock() {
        i2c_->unlock();
    }

private:
    I2cClass* i2c_;
};


int hal_i2c_init(hal_i2c_interface_t i2c, const hal_i2c_config_t* config) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    return instance->init(config);
}

void hal_i2c_set_speed(hal_i2c_interface_t i2c, uint32_t speed, void* reserved) {
    auto instance = I2cClass::getInstance(i2c);
    if (!instance) {
        return;
    }
    I2cLock lk(instance);
    instance->setSpeed(speed);
}

void hal_i2c_stretch_clock(hal_i2c_interface_t i2c, bool stretch, void* reserved) {
    // always enabled
}

void hal_i2c_begin(hal_i2c_interface_t i2c, hal_i2c_mode_t mode, uint8_t address, void* reserved) {
    auto instance = I2cClass::getInstance(i2c);
    if (!instance) {
        return;
    }
    I2cLock lk(instance);
    instance->begin(mode, address);
}

void hal_i2c_end(hal_i2c_interface_t i2c, void* reserved) {
    auto instance = I2cClass::getInstance(i2c);
    if (!instance) {
        return;
    }
    I2cLock lk(instance);
    if (hal_i2c_is_enabled(i2c, nullptr)) {
        instance->end();
    }
}

uint32_t hal_i2c_request(hal_i2c_interface_t i2c, uint8_t address, uint8_t quantity, uint8_t stop, void* reserved) {
    hal_i2c_transmission_config_t conf = {
        .size = sizeof(hal_i2c_transmission_config_t),
        .version = 0,
        .address = address,
        .reserved = {0},
        .quantity = quantity,
        .timeout_ms = HAL_I2C_DEFAULT_TIMEOUT_MS,
        .flags = (uint32_t)(stop ? HAL_I2C_TRANSMISSION_FLAG_STOP : 0)
    };
    return hal_i2c_request_ex(i2c, &conf, nullptr);
}

int32_t hal_i2c_request_ex(hal_i2c_interface_t i2c, const hal_i2c_transmission_config_t* config, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), 0);
    if (!hal_i2c_is_enabled(i2c, nullptr) || !config) {
        return 0;
    }
    I2cLock lk(instance);
    return instance->requestFrom(config);
}

void hal_i2c_begin_transmission(hal_i2c_interface_t i2c, uint8_t address, const hal_i2c_transmission_config_t* config) {
    auto instance = I2cClass::getInstance(i2c);
    if (!instance) {
        return;
    }
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return;
    }
    instance->setConfigOrDefault(config, address);
}

